{ "track":{"name":"Rap Devil","url":"https://www.last.fm/music/Machine+Gun+Kelly/_/Rap+Devil","duration":"286000","streamable":{"#text":"0","fulltrack":"0"},"listeners":"16279","playcount":"89536","artist":{"name":"Machine Gun Kelly","mbid":"f6af669a-56ea-448a-a044-de76181ada33","url":"https://www.last.fm/music/Machine+Gun+Kelly"},"album":{"artist":"Machine Gun Kelly","title":"Rap Devil","url":"https://www.last.fm/music/Machine+Gun+Kelly/Rap+Devil","image":[{"#text":"https://lastfm-img2.akamaized.net/i/u/34s/86c4a3dfaf7091b6cdd49f146771f35d.png","size":"small"},{"#text":"https://lastfm-img2.akamaized.net/i/u/64s/86c4a3dfaf7091b6cdd49f146771f35d.png","size":"medium"},{"#text":"https://lastfm-img2.akamaized.net/i/u/174s/86c4a3dfaf7091b6cdd49f146771f35d.png","size":"large"},{"#text":"https://lastfm-img2.akamaized.net/i/u/300x300/86c4a3dfaf7091b6cdd49f146771f35d.png","size":"extralarge"}]},"toptags":{"tag":[{"name":"Hip-Hop","url":"https://www.last.fm/tag/Hip-Hop"},{"name":"rap","url":"https://www.last.fm/tag/rap"},{"name":"Diss","url":"https://www.last.fm/tag/Diss"},{"name":"Eminem","url":"https://www.last.fm/tag/Eminem"},{"name":"diss track","url":"https://www.last.fm/tag/diss+track"}]},"wiki":{"published":"05 Sep 2018, 17:51","summary":"After hearing his name dropped on Eminem's surprise Kamikaze album, Machine Gun Kelly took the weekend to pen his response on wax and take aim at one of his idols on the eviscerating \"Rap Devil\" on Monday (Sept. 3). The retaliation has received approval from differing crowds within the hip-hop community as the ball now goes back to Em's court for a rebuttal. \n\nMGK's lyrical assault attacks Em's inability to age gracefully in hip-hop, challenges his public bitterness when he lives a lavish private life <a href=\"http://www.last.fm/music/Machine+Gun+Kelly/_/Rap+Devil\">Read more on Last.fm</a>.","content":"After hearing his name dropped on Eminem's surprise Kamikaze album, Machine Gun Kelly took the weekend to pen his response on wax and take aim at one of his idols on the eviscerating \"Rap Devil\" on Monday (Sept. 3). The retaliation has received approval from differing crowds within the hip-hop community as the ball now goes back to Em's court for a rebuttal. \n\nMGK's lyrical assault attacks Em's inability to age gracefully in hip-hop, challenges his public bitterness when he lives a lavish private life, questions why the 45-year-old attempted to have him banned from his Shade 45 radio station (over a harmless tweet regarding his daughter from six years ago), and much more. \n\nKelly defended his actions of answering the Rap God's shots from \"Not Alike\" on behalf of his entire generation. \"I'm standing up for not just myself, but my generation,\" he wrote. \"I'm doing the same shit you did back in your day. life is still real on my side, and I had to take time from the grind to defend myself from someone I called an idol. love, Rap Devil.\" \n\nMGK also possibly sent subliminal smoke toward Em with his verse on Tech N9ne's \"No Reason\" earlier in 2018. \"To remind y’all you just Rap and not God and I don’t care who got bars,\" he raps.\n\nWhile the public awaits the Detroit-bred rapper's response, Billboard deciphers the standout bars from Machine Gun Kelly's scorching \"Rap Devil\" diss track. \n\nMGK mentions his initial 2012 insensitive tweet regarding Em's daughter, who was 16-years-old at the time, when he commented on photos of her that surfaced online. Kelly's sentiments got under Eminem's skin and the tweet still angers him to this day as seen by his response last Friday (Aug. 31) on \"Not Alike.\" \"Ok so I just saw a picture of Eminem's daughter... and I have to say, she's hot as fuck, in the most respectful way possible [because Eminem] is king,\" Machine Gun Kelly penned in May of 2012. \n\nAt the turn of the century, Eminem became known for his baggy color-coordinated sweatsuits that were a staple of his wardrobe throughout much of his meteoric rise. He even capped off some outfits with a du-rag back then. MGK marvels looking back at vintage Slim Shady and clowns him for his former fashion choices. The 28-year-old then wonders how someone with a net worth north of 9 figures could still be so angry and lash out at compatriots within the genre that has allowed him to prosper.  <a href=\"http://www.last.fm/music/Machine+Gun+Kelly/_/Rap+Devil\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}}}